// Импорт библиотеки Mongoose для работы с MongoDB и создания схем данных
const mongoose = require("mongoose")

// Создание новой схемы (структуры) для документа продукта в базе данных
const productSchema = new mongoose.Schema({
    title: {
        type: String, 
        require: [true, "Название обязательно!"], // Указание на обязательность заполнения поля с текстом сообщения при проверке
        trim: true // Автоматическое удаление пробелов в начале и конце строки при сохранении
    },
    
    // Поле "description" (описание продукта)
    description: {
        type: String, 
        require: [true, "Описание обязательно!"], 
        trim: true // Автоматическое удаление пробелов в начале и конце строки при сохранении
    },
    
    // Поле "price" (цена продукта)
    price: {
        type: Number, 
        require: [true, "Цена обязательна!"], // Указание на обязательность заполнения поля с текстом сообщения при проверке
        min: 0 // Установка минимально допустимого значения для числа (ноль)
    },
     model: {
        type: String, 
        require: [true, "Выберите модель!"], // Указание на обязательность заполнения поля с текстом сообщения при проверке
        min: 0 // Установка минимально допустимого значения для числа (ноль)
    }
    
})

// Компиляция схемы в модель с именем 'Product' и экспорт этой модели для использования в других файлах приложения
module.exports = mongoose.model('store', productSchema)